* Logging
  CLOCK: [2018-11-26 Mo 11:41]--[2018-11-26 Mo 14:16] =>  2:35
  CLOCK: [2018-11-25 So 14:07]--[2018-11-25 So 19:17] =>  5:10
  CLOCK: [2018-11-22 Do 12:44]--[2018-11-22 Do 22:40] =>  9:56
  CLOCK: [2018-11-20 Di 15:56]--[2018-11-20 Di 17:23] =>  1:27
  CLOCK: [2018-11-20 Di 12:19]--[2018-11-20 Di 14:50] =>  2:31
  CLOCK: [2018-11-19 Mo 13:25]--[2018-11-19 Mo 16:08] =>  2:43
  CLOCK: [2018-11-18 So 23:04]--[2018-11-19 Mo 03:01] =>  3:57
  CLOCK: [2018-11-17 Sa 14:15]--[2018-11-17 Sa 18:23] =>  4:08

** [2018-11-16 Fr]
mkvirtualenv monker_automation

python -m pip install jedi
python -m pip install importmagic
python -m pip install autopep8
python -m pip install yapf

** [2018-11-17 Sa] 

TODO 
on trips board pairs where there is rank on board doesnt get added
straights on 4 straight boards doesnt work properly (bad grouping)

** [2018-11-19 Mo]
   :PROPERTIES:
   :ORDERED:  t
   :END:

TODO
might be good idea to also fill description list for view file
group made hands based on blocker on flush boards?
group straights straight draws based on outs/nuttynes
4 straight boards handled badly!! (blockers and straight grouping)

**
** [2018-11-25 So]

TODO baord string is empty when no action has happend
TODO kill TK window
TODO select CSV instead when saving range 4 the first time
TODO exclude range not working currently (discard it?)

